IDEA StatiCa Open Model
HingeElement1D.InitialStiffnessX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Initial stiffness X dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double InitialStiffnessX { get; set; }
Public Property InitialStiffnessX As Double
	Get
	Set
public:
property double InitialStiffnessX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace